{
  "backend/main.mo": "Motoko backend actor managing per‑user categories, items, bills, settings, profiles, and PDF blobs with access‑controlled sync and storage operations.",
  "feature_evidence.json": "Feature evidence report describing a UI consistency requirement and listing related frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files detailing their purpose across routing, layout, pages, models, and storage.",
  "frontend/index.css": "Tailwind CSS configuration defining light/dark theme variables and base styling rules.",
  "frontend/index.html": "Minimal HTML bootstrap file mounting the React app and loading main.tsx.",
  "frontend/src/analytics/computeAnalytics.ts": "Computes sales analytics totals, monthly stats, and product/category breakdowns from bills and items.",
  "frontend/src/App.tsx": "Root React app configuring routing, theming, Internet Identity, auto‑sync, and global providers.",
  "frontend/src/billing/amountInWords.ts": "Converts numeric currency amounts into Indian‑style words including rupees and paise.",
  "frontend/src/billing/billNumber.ts": "Generates sequential yearly invoice numbers by scanning existing stored bills.",
  "frontend/src/billing/calc.ts": "Utility functions computing item totals with discount/GST and full bill totals.",
  "frontend/src/components/charts/SimpleBarChart.tsx": "Reusable bar chart component using Recharts to display monthly sales data.",
  "frontend/src/components/charts/SimpleCategoryChart.tsx": "Pie chart component rendering category‑wise sales distribution with dynamic colors.",
  "frontend/src/components/charts/SimpleProductChart.tsx": "Renders a vertical bar chart of product amounts using Recharts and shows a fallback when no data is provided.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with navigation, dynamic document titles, routed content, and a footer.",
  "frontend/src/components/layout/ResponsiveNav.tsx": "Provides mobile drawer and desktop tab navigation, highlighting active routes and enabling route changes.",
  "frontend/src/components/sync/SyncCard.tsx": "Displays cloud sync controls, authentication state, auto-sync options, and manual sync actions.",
  "frontend/src/components/sync/SyncStatusBadge.tsx": "Shows a status badge reflecting sync states like idle, syncing, success, or error.",
  "frontend/src/constants/app.ts": "Defines the application name constant.",
  "frontend/src/export/xlsxExport.ts": "Generates CSV exports of bills and bill items and triggers a file download based on report type.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to identity changes, invalidating dependent queries as needed.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication and state.",
  "frontend/src/hooks/useLocalBills.ts": "Fetches local bills and items using React Query and provides an invalidate helper for related data.",
  "frontend/src/index.css": "Configures Tailwind plus custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/models/settings.ts": "Defines the settings model and default app settings including sync and company info.",
  "frontend/src/models/types.ts": "Declares TypeScript interfaces for categories, items, bills, and bill items.",
  "frontend/src/pages/BillPreviewPage.tsx": "Loads draft or saved bill data, renders a preview, and supports saving or downloading the bill as a PDF.",
  "frontend/src/pages/CreateBillPage.tsx": "Creates a new bill with dynamic item rows, auto-fills catalogue data, recalculates totals, and navigates to preview.",
  "frontend/src/pages/DashboardPage.tsx": "Displays sales analytics with summary cards and charts based on locally stored bills and items.",
  "frontend/src/pages/ExportBackupPage.tsx": "Exports bills and items to Excel with weekly, monthly, full, or manual backup options.",
  "frontend/src/pages/ItemsCategoriesPage.tsx": "Manages item categories and master items with create, edit, and delete actions using React Query.",
  "frontend/src/pages/SavedBillsPage.tsx": "Lists saved bills with search, viewing, PDF opening/downloading, and PDF regeneration features.",
  "frontend/src/pages/SettingsPage.tsx": "React settings page allowing editing of company info, GST, backup frequency, and uploading logo/QR, with persistence via useSettings.",
  "frontend/src/pages/StartPage.tsx": "Landing page showing app branding and features with a button to navigate to the dashboard.",
  "frontend/src/pdf/generateBillPdf.ts": "Generates an HTML-based bill PDF blob using company settings, bill details, and inline styling.",
  "frontend/src/settings/useSettings.ts": "React hook that loads, caches, and updates settings using react-query and local storage repository.",
  "frontend/src/storage/localDb.ts": "Initializes and upgrades IndexedDB schema for categories, items, bills, settings, and bill PDFs with migration logic.",
  "frontend/src/storage/repositories.ts": "CRUD operations for categories, items, bills, and settings using IndexedDB transactions with soft-delete handling.",
  "frontend/src/sync/entityAdapters.ts": "No summary available.",
  "frontend/src/sync/merge.ts": "Implements last-write-wins merge logic for categories, items, bills, bill items, and settings during sync.",
  "frontend/src/sync/pdfSync.ts": "Converts between browser Blob and ExternalBlob formats, optionally tracking upload progress.",
  "frontend/src/sync/reactQueryInvalidation.ts": "Invalidates all local React Query caches related to app data collections.",
  "frontend/src/sync/syncService.ts": "Coordinates full sync flow including uploading local changes, downloading remote data, merging, and syncing PDFs.",
  "frontend/src/sync/useAutoSync.ts": "Automatically triggers sync on load when enabled, authenticated, idle, and not yet auto-synced.",
  "frontend/src/sync/useSync.ts": "Provides sync state management, triggering performSync and updating UI state and settings.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session-based parameters.",
  "frontend/src/vite-env.d.ts": "Declares Vite environment variable types including optional II URL.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, typography, container settings, and plugins.",
  "project_state.json": "Project metadata describing app name requirements, versioning, features, and state."
}