{
  "backend/main.mo": "Minimal Motoko canister actor with no functions.",
  "feature_evidence.json": "Metadata describing a feature update linking several frontend files and components with high confidence.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries for many frontend source files defining pages, models, storage, billing utilities, and layout.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and applying base styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/analytics/computeAnalytics.ts": "Computes sales totals, monthly data, and product/category breakdowns from bills and bill items.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with ThemeProvider and Toaster.",
  "frontend/src/billing/amountInWords.ts": "Converts numeric amounts into Indian currency words including rupees and paise.",
  "frontend/src/billing/billNumber.ts": "Generates sequential invoice numbers prefixed with the current year by checking existing bills.",
  "frontend/src/billing/calc.ts": "Provides pure functions for calculating item and bill totals with discount and GST.",
  "frontend/src/components/charts/SimpleBarChart.tsx": "Recharts bar chart component for monthly sales with tooltip and responsive layout.",
  "frontend/src/components/charts/SimpleCategoryChart.tsx": "Pie chart displaying sales by category with labels, legend, and color mapping.",
  "frontend/src/components/charts/SimpleProductChart.tsx": "Vertical bar chart showing sales by product with tooltips and responsive design.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper handling navigation visibility, rendering routed pages, and adding a footer.",
  "frontend/src/components/layout/ResponsiveNav.tsx": "Responsive navigation component providing mobile drawer and desktop tab navigation based on route state.",
  "frontend/src/export/xlsxExport.ts": "Exports bills and bill items into a CSV file and triggers a download.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor using the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and state management.",
  "frontend/src/hooks/useLocalBills.ts": "Fetches local bills and bill items from storage and exposes an invalidate helper.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and base styles.",
  "frontend/src/main.tsx": "App entry point initializing React, query client, and Internet Identity provider.",
  "frontend/src/models/settings.ts": "Defines settings model and default settings for company and backup preferences.",
  "frontend/src/models/types.ts": "Contains TypeScript interfaces for categories, items, bills, and bill items.",
  "frontend/src/pages/BillPreviewPage.tsx": "Displays a bill preview with options to print, download, or save the bill PDF.",
  "frontend/src/pages/CreateBillPage.tsx": "Bill creation form allowing item entry, totals calculation, and navigation to preview.",
  "frontend/src/pages/DashboardPage.tsx": "Displays analytics with summary cards and charts using locally stored bills and items.",
  "frontend/src/pages/ExportBackupPage.tsx": "Provides Excel export and backup options, filtering data by date ranges and saving manual backups.",
  "frontend/src/pages/ItemsCategoriesPage.tsx": "Manages item categories and items with CRUD dialogs, validation, and data persistence.",
  "frontend/src/pages/SavedBillsPage.tsx": "Lists saved bills with search, view, and PDF open actions using stored bill data.",
  "frontend/src/pages/SettingsPage.tsx": "Allows editing business settings, GST defaults, backup frequency, and uploading company assets.",
  "frontend/src/pages/StartPage.tsx": "Landing page introducing the app and linking to the dashboard with a branded UI.",
  "frontend/src/pdf/generateBillPdf.ts": "Builds an HTML-based bill layout using bill and settings data and returns it as a Blob for PDF-like output.",
  "frontend/src/settings/useSettings.ts": "React-query hook that loads settings from storage, provides update functionality, and exposes loading state.",
  "frontend/src/storage/localDb.ts": "Initializes and returns an IndexedDB database with object stores for categories, items, bills, billItems, and settings.",
  "frontend/src/storage/repositories.ts": "Provides CRUD functions for categories, items, bills, bill items, and settings using IndexedDB transactions.",
  "frontend/src/vite-env.d.ts": "Declares Vite env typings, including optional VITE_II_URL.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, container settings, animations, and plugins.",
  "project_state.json": "Defines project metadata, architecture notes, requirements coverage, and known issues for the Mobile Receipt app."
}