{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Centralize and enforce fixed app name “Mobile Receipt” across UI and document title",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Centralize the app name as a single exported frontend constant and reuse it for all app-brand text and the document title across routes.",
      "acceptanceCriteria": [
        "All visible app-brand text in the UI matches exactly “Mobile Receipt” (including Start page, mobile/desktop nav brand, and footer).",
        "The HTML document <title> remains “Mobile Receipt” after navigation between routes.",
        "There is a single source of truth (one exported constant) for the app name used by the above UI locations, rather than repeated hard-coded strings."
      ],
      "file_operations": [
        {
          "path": "frontend/src/constants/app.ts",
          "operation": "create",
          "description": "Create and export a single source-of-truth constant (e.g., APP_NAME) whose value is exactly “Mobile Receipt”, to be reused anywhere the app name is rendered (UI brand text, alt text, and document title)."
        },
        {
          "path": "frontend/src/pages/StartPage.tsx",
          "operation": "modify",
          "description": "Replace hard-coded app-name usages with the centralized app-name constant for the Start page heading and the logo alt text (ensuring the visible brand text renders exactly “Mobile Receipt”)."
        },
        {
          "path": "frontend/src/components/layout/ResponsiveNav.tsx",
          "operation": "modify",
          "description": "Replace hard-coded app-name usages with the centralized app-name constant for mobile/desktop navigation brand text and logo alt text (ensuring the visible brand text renders exactly “Mobile Receipt”)."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Replace the hard-coded footer brand text with the centralized app-name constant, and add route-change-safe document title synchronization (set document.title to the centralized app-name constant whenever the route/location changes)."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Initialize document.title from the centralized app-name constant during app bootstrap to ensure the initial tab title is set from the single source of truth."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Remove the hard-coded “Mobile Receipt” from the static <title> so that the document title is set exclusively by the centralized frontend constant at runtime (keeping the runtime title exactly “Mobile Receipt”)."
        }
      ]
    }
  ]
}